Revit 2027 API
ParameterTypeId.FabricationProductDataRange Property
 "Product Range"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationProductDataRange { get; }
Public Shared ReadOnly Property FabricationProductDataRange As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationProductDataRange {
	ForgeTypeId^ get ();
}
static member FabricationProductDataRange : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace